tutorials/NucleateBoiling2D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    Cavity
    {
		type            fixedValue;
		value           uniform (0 0 0);
    }

    Base
    {
		type            fixedValue;
		value           uniform (0 0 0);
	}

    FarStream
    {
        type            zeroGradient;
    }

    Top
    {
        type            zeroGradient;
    }

    Axis
    {
        type            symmetryPlane;
    }

    FrontNBack_pos
    {
        type            wedge;
    }

    FrontNBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //