tutorials/NucleateBoiling2D/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Cavity
    {
        type            fixedFluxPressure;
    }

    Base
    {
        type            fixedFluxPressure;
    }

    FarStream
    {
		type           zeroGradient;
    }

    Top
    {
        type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 0;
        value           uniform 0;
    }

    Axis
    {
        type            symmetryPlane;
    }

    FrontNBack_pos
    {
        type            wedge;
    }

    FrontNBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //