tutorials/NucleateBoiling2D/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

twoPhase
{
    transportModel  twoPhase;
    phase1          phase1;
    phase2          phase2;
}

//Water 450K
phase1
{
    transportModel  		Newtonian;
    nu              		nu [ 0 2 -1 0 0 0 0 ] 1.71E-7;
    rho             		rho [ 1 -3 0 0 0 0 0 ] 890.47;
    thermalTransportModel	Fourier;
    lambda			lambda [1 1 -3 -1 0 0 0] 0.678;
    cp				cp [ 0 2 -2 -1 0 0 0] 4400;
}

phase2
{
    transportModel		Newtonian;
    nu				nu [ 0 2 -1 0 0 0 0 ] 3.089E-6;
    rho				rho [ 1 -3 0 0 0 0 0 ] 4.808;
    thermalTransportModel	Fourier;
    lambda			lambda [1 1 -3 -1 0 0 0] 0.0331;
    cp				cp [ 0 2 -2 -1 0 0 0] 2560;
}

//sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.0429;
sigma           0.0429;

T_0			   0;


thermalPhaseChange
{
	model                InterfaceEquilibrium_SplitDilatation;
	h_lv		         h_lv  [0 2 -2 0 0 0 0 ] 2024E3;
	T_sat		         T_sat [0 0 0 1 0 0 0] 0;
	CondThresh           0.95; //Interface threshold for condensing cell pairs
	EvapThresh           0.05; //Interface threshold for evaporating cell pairs
	RelaxFac             1.0; //Under-relax phase change rate in each time step
}

surfaceTensionForce
{
	model               Brackbill;
}


// ************************************************************************* //